3D_riblet/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#includeIfPresent "../parameters.dat"

defaultFieldValues
(
    volScalarFieldValue alpha.biofilm 0
);

bf_backend #calc "$bf_zOffset+$bf_length";

regions
(
    boxToCell
    {
        //box (0 0 $bf_zOffset) ($bf_width $bf_thickness $bf_backend);
        box (-2000 0 0) (2000 $bf_thickness 2000);
        fieldValues
        (
            volScalarFieldValue alpha.biofilm 1
        );
    }
);


// ************************************************************************* //
